test/load/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 180
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 10
      name: "Cool-down"

  environments:
    development:
      target: 'http://localhost:3000'
    staging:
      target: 'https://api-staging.careservices.com'
    production:
      target: 'https://api.careservices.com'

  processor: "./test/load/load-test-processor.js"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery Load Test'

  variables:
    customerEmails:
      - "loadtest1@example.com"
      - "loadtest2@example.com"
      - "loadtest3@example.com"
      - "loadtest4@example.com"
      - "loadtest5@example.com"
    
    providerEmails:
      - "provider1@example.com"
      - "provider2@example.com"
      - "provider3@example.com"
    
    serviceCategories:
      - "massage"
      - "fitness"
      - "beauty"
      - "wellness"
      - "therapy"

scenarios:
  # Health check scenario (baseline)
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  # API documentation access
  - name: "API Documentation"
    weight: 2
    flow:
      - get:
          url: "/api/docs"
          expect:
            - statusCode: 200

  # Authentication flow
  - name: "User Authentication"
    weight: 15
    flow:
      # Register new user
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "{{ $randomString() }}@loadtest.com"
            password: "LoadTest123!"
            fullName: "{{ $randomString() }} User"
            role: "customer"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [201, 409] # 201 for new user, 409 for existing

      # Login user
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ customerEmails[$randomNumber(0, 4)] }}"
            password: "LoadTest123!"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

  # Customer service discovery
  - name: "Service Discovery"
    weight: 25
    flow:
      # Get service categories
      - get:
          url: "/api/v1/customer/categories"
          expect:
            - statusCode: 200
            - hasProperty: "data"

      # Search services
      - get:
          url: "/api/v1/customer/search"
          qs:
            category: "{{ serviceCategories[$randomNumber(0, 4)] }}"
            location: "New York"
            radius: 25
            limit: 20
          expect:
            - statusCode: 200
            - hasProperty: "data"

      # Get provider details
      - function: "selectRandomProvider"
      - get:
          url: "/api/v1/customer/providers/{{ providerId }}"
          ifTrue: "{{ providerId }}"
          expect:
            - statusCode: [200, 404]

  # Provider management
  - name: "Provider Operations"
    weight: 20
    flow:
      # Login as provider
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ providerEmails[$randomNumber(0, 2)] }}"
            password: "LoadTest123!"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

      # Get provider dashboard
      - get:
          url: "/api/v1/provider/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "{{ authToken }}"
          expect:
            - statusCode: [200, 401]

      # Get provider bookings
      - get:
          url: "/api/v1/provider/bookings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "{{ authToken }}"
          expect:
            - statusCode: [200, 401]

      # Get provider services
      - get:
          url: "/api/v1/provider/services"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "{{ authToken }}"
          expect:
            - statusCode: [200, 401]

  # Booking flow
  - name: "Booking Process"
    weight: 20
    flow:
      # Login as customer
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ customerEmails[$randomNumber(0, 4)] }}"
            password: "LoadTest123!"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

      # Check availability
      - get:
          url: "/api/v1/customer/availability"
          qs:
            providerId: "{{ $uuid() }}"
            date: "{{ $isoTimestamp() }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "{{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      # Create booking (simulate)
      - function: "simulateBooking"

  # Admin operations
  - name: "Admin Dashboard"
    weight: 10
    flow:
      # Login as admin (if admin credentials available)
      - function: "loginAsAdmin"

      # Get admin dashboard
      - get:
          url: "/api/v1/admin/dashboard"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          ifTrue: "{{ adminToken }}"
          expect:
            - statusCode: [200, 401, 403]

      # Get system stats
      - get:
          url: "/api/v1/admin/stats"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          ifTrue: "{{ adminToken }}"
          expect:
            - statusCode: [200, 401, 403]

  # Payment simulation
  - name: "Payment Processing"
    weight: 8
    flow:
      # Login as customer
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ customerEmails[$randomNumber(0, 4)] }}"
            password: "LoadTest123!"
          capture:
            - json: "$.access_token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

      # Simulate payment processing
      - function: "simulatePayment"

  # Real-time features
  - name: "WebSocket Connections"
    weight: 5
    flow:
      # Test WebSocket endpoint (if available)
      - function: "testWebSocketConnection"

# Error handling and monitoring
expect:
  - statusCode: [200, 201, 401, 403, 404, 429]

# Performance thresholds
ensure:
  # 95% of requests should complete within 500ms
  p95: 500
  
  # 99% of requests should complete within 1000ms
  p99: 1000
  
  # Average response time should be under 200ms
  median: 200
  
  # Error rate should be less than 1%
  maxErrorRate: 1

# Custom metrics
metrics:
  - name: "authentication_success_rate"
    unit: "percent"
  - name: "booking_completion_rate"
    unit: "percent"
  - name: "search_response_time"
    unit: "milliseconds"
  - name: "payment_success_rate"
    unit: "percent"

# Reporting
report:
  - console
  - json: "./test/results/load-test-{{ $timestamp }}.json"
  - html: "./test/results/load-test-{{ $timestamp }}.html"